Core/src/Documents/ПачкаРазделов6РасчетаРСВ_1/ПачкаРазделов6РасчетаРСВ_1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПачкаРазделов6РасчетаРСВ_1</name>
  <registerRecords>AccumulationRegister.СтраховыеВзносыПереданныеВПФР</registerRecords>
  <attributes>
    <name>ОтчетныйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСведенийСЗВ</name>
    <type>
      <types>EnumRef.ТипыСведенийСЗВ</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФРвКорректируемыйПериод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДляПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>68</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПринятВПФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСформирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОтчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СтраховойНомерПФР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоСтраховая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоначисленоСтраховая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксСтаж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксНачисленныеВзносы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксЗаработок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияОЗаработке</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияЗастрахованныхЛиц</name>
      <type>
        <types>EnumRef.КатегорииЗастрахованныхЛицДляПФР</types>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заработок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяВзносамиДоПредельнойВеличины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоДоговорамГПХДоПредельнойВеличины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяВзносамиСвышеПредельнойВеличины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияОЗаработкеНаВредныхИТяжелыхРаботах</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассУсловийТруда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаписиОСтаже</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерОсновнойЗаписи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДополнительнойЗаписи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсобыеУсловияТруда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПозицииСписка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеИсчисляемогоСтажа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервыйПараметрИсчисляемогоСтажа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВторойПараметрИсчисляемогоСтажа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТретийПараметрИсчисляемогоСтажа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеВыслугиЛет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервыйПараметрВыслугиЛет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВторойПараметрВыслугиЛет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТретийПараметрВыслугиЛет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТерриториальныеУсловия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрТерриториальныхУсловий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ТипыСведенийСЗВ/ТипыСведенийСЗВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСведенийСЗВ</name>
  <enumValues>
    <name>ИСХОДНАЯ</name>
  </enumValues>
  <enumValues>
    <name>КОРРЕКТИРУЮЩАЯ</name>
  </enumValues>
  <enumValues>
    <name>ОТМЕНЯЮЩАЯ</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПачкаРазделов6РасчетаРСВ_1/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РежимЗаписиТекущегоДокумента = РежимЗаписи;
	
КонецПроцедуры

Процедура СоздатьВТСТаблицамиОбъекта(МенеджерВременныхТаблиц)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("ЗаписиОСтаже", ЗаписиОСтаже);
	Запрос.УстановитьПараметр("СведенияОЗаработке", СведенияОЗаработке);
	Запрос.УстановитьПараметр("СведенияОЗаработкеНаВредныхИТяжелыхРаботах", СведенияОЗаработкеНаВредныхИТяжелыхРаботах);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.НомерСтроки,
	|	Сотрудники.Сотрудник,
	|	Сотрудники.Фамилия,
	|	Сотрудники.Имя,
	|	Сотрудники.Отчество,
	|	Сотрудники.СтраховойНомерПФР,
	|	Сотрудники.НачисленоСтраховая,
	|	Сотрудники.ДоначисленоСтраховая
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	&Сотрудники КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка,
	|	СведенияОЗаработке.НомерСтроки,
	|	СведенияОЗаработке.Сотрудник,
	|	СведенияОЗаработке.КатегорияЗастрахованныхЛиц,
	|	СведенияОЗаработке.Месяц,
	|	СведенияОЗаработке.Заработок,
	|	СведенияОЗаработке.ОблагаетсяВзносамиДоПредельнойВеличины,
	|	СведенияОЗаработке.ПоДоговорамГПХДоПредельнойВеличины,
	|	СведенияОЗаработке.ОблагаетсяВзносамиСвышеПредельнойВеличины
	|ПОМЕСТИТЬ ВТСведенияОЗаработке
	|ИЗ
	|	&СведенияОЗаработке КАК СведенияОЗаработке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.НомерСтроки,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.Сотрудник,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.КлассУсловийТруда,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.Месяц,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТСведенияОЗаработкеНаВредныхИТяжелыхРаботах
	|ИЗ
	|	&СведенияОЗаработкеНаВредныхИТяжелыхРаботах КАК СведенияОЗаработкеНаВредныхИТяжелыхРаботах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка,
	|	ЗаписиОСтаже.НомерСтроки,
	|	ЗаписиОСтаже.Сотрудник,
	|	ЗаписиОСтаже.НомерОсновнойЗаписи,
	|	ЗаписиОСтаже.НомерДополнительнойЗаписи,
	|	ЗаписиОСтаже.ДатаНачалаПериода,
	|	ЗаписиОСтаже.ДатаОкончанияПериода,
	|	ЗаписиОСтаже.ОсобыеУсловияТруда,
	|	ЗаписиОСтаже.КодПозицииСписка,
	|	ЗаписиОСтаже.ОснованиеИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ПервыйПараметрИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ВторойПараметрИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ТретийПараметрИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ОснованиеВыслугиЛет,
	|	ЗаписиОСтаже.ПервыйПараметрВыслугиЛет,
	|	ЗаписиОСтаже.ВторойПараметрВыслугиЛет,
	|	ЗаписиОСтаже.ТретийПараметрВыслугиЛет,
	|	ЗаписиОСтаже.ТерриториальныеУсловия,
	|	ЗаписиОСтаже.ПараметрТерриториальныхУсловий
	|ПОМЕСТИТЬ ВТТаблицаСтажа
	|ИЗ
	|	&ЗаписиОСтаже КАК ЗаписиОСтаже
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиОСтаже.Сотрудник,
	|	ЗаписиОСтаже.НомерСтроки,
	|	ЗаписиОСтаже.НомерОсновнойЗаписи,
	|	ЗаписиОСтаже.НомерДополнительнойЗаписи,
	|	ЗаписиОСтаже.ДатаНачалаПериода,
	|	ЗаписиОСтаже.ДатаОкончанияПериода,
	|	ЗаписиОСтаже.ТерриториальныеУсловия,
	|	ЗаписиОСтаже.ПараметрТерриториальныхУсловий,
	|	ЗаписиОСтаже.ОсобыеУсловияТруда,
	|	ЗаписиОСтаже.КодПозицииСписка,
	|	ЗаписиОСтаже.ОснованиеИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ПервыйПараметрИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ВторойПараметрИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ТретийПараметрИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ОснованиеВыслугиЛет,
	|	ЗаписиОСтаже.ПервыйПараметрВыслугиЛет,
	|	ЗаписиОСтаже.ВторойПараметрВыслугиЛет,
	|	ЗаписиОСтаже.ТретийПараметрВыслугиЛет,
	|	СотрудникиНомераСтрок.НомерСтроки КАК НомерСтрокиСотрудник
	|ПОМЕСТИТЬ ВТЗаписиОСтаже
	|ИЗ
	|	ВТТаблицаСтажа КАК ЗаписиОСтаже
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК СотрудникиНомераСтрок
	|		ПО ЗаписиОСтаже.Сотрудник = СотрудникиНомераСтрок.Сотрудник";
	
	Запрос.Выполнить();	
КонецПроцедуры	

Функция СформироватьЗапросПоЗаработкуДляПроверкиЗаполнения(МенеджерВременныхТаблиц)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.НомерСтроки КАК НомерСтрокиСотрудник,
	|	СведенияОЗаработке.НомерСтроки,
	|	СведенияОЗаработке.Сотрудник,
	|	СведенияОЗаработке.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	СведенияОЗаработке.Месяц КАК Месяц,
	|	СведенияОЗаработке.Заработок,
	|	СведенияОЗаработке.ОблагаетсяВзносамиДоПредельнойВеличины,
	|	СведенияОЗаработке.ПоДоговорамГПХДоПредельнойВеличины,
	|	СведенияОЗаработке.ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	ВЫБОР
	|		КОГДА СведенияОЗаработке.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СведенияЗаполнены
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОЗаработке КАК СведенияОЗаработке
	|		ПО Сотрудники.Сотрудник = СведенияОЗаработке.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиСотрудник,
	|	КатегорияЗастрахованныхЛиц,
	|	Месяц";
	
	Возврат Запрос.Выполнить();
КонецФункции	

Функция СформироватьЗапросПоВредномуЗаработкуДляПроверкиЗаполнения(МенеджерВременныхТаблиц)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.НомерСтроки КАК НомерСтрокиСотрудник,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.Ссылка,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.НомерСтроки,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.Сотрудник,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.КлассУсловийТруда КАК КлассУсловийТруда,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.Месяц КАК Месяц,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СведенияОЗаработкеНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ВЫБОР
	|		КОГДА СведенияОЗаработкеНаВредныхИТяжелыхРаботах.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СведенияЗаполнены
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОЗаработкеНаВредныхИТяжелыхРаботах КАК СведенияОЗаработкеНаВредныхИТяжелыхРаботах
	|		ПО Сотрудники.Сотрудник = СведенияОЗаработкеНаВредныхИТяжелыхРаботах.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиСотрудник,
	|	КлассУсловийТруда,
	|	Месяц";
	
	Возврат Запрос.Выполнить();	
КонецФункции	

Процедура ПроверитьДанныеДокумента(Ошибки, Отказ = Ложь, НеПроверяемыеРеквизиты = Неопределено) Экспорт 
	ПроверитьДанныеШапкиДокумента(Ошибки, Отказ, НеПроверяемыеРеквизиты);
	
	ЗапросПоСтрокамДокумента = Неопределено;
	
	
	Если ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
		ПроверяемыйПериод = ОтчетныйПериод;
	Иначе
		ПроверяемыйПериод = КорректируемыйПериод;
	КонецЕсли;
	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТСТаблицамиОбъекта(МенеджерВременныхТаблиц);
	ВыборкаПоСтрокамДокумента = СформироватьЗапросПоЗаработкуДляПроверкиЗаполнения(МенеджерВременныхТаблиц).Выбрать();
	ВыборкаПоЗаработку = СформироватьЗапросПоЗаработкуДляПроверкиЗаполнения(МенеджерВременныхТаблиц).Выбрать();
	
	ВыборкаПоВредномуЗаработку = СформироватьЗапросПоВредномуЗаработкуДляПроверкиЗаполнения(МенеджерВременныхТаблиц).Выбрать();

	Пока ВыборкаПоСтрокамДокумента.СледующийПоЗначениюПоля("НомерСтрокиСотрудник") Цикл
		ВыборкаПоЗаработку.СледующийПоЗначениюПоля("НомерСтрокиСотрудник");
		ВыборкаПоВредномуЗаработку.СледующийПоЗначениюПоля("НомерСтрокиСотрудник");
		
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда 
			
			Если ВыборкаПоСтрокамДокумента.КонфликтующаяСтрока <> Null Тогда  
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='ინფორმაცია თანამშრომელ %1-ის შესახებ დოკუმენტში შეყვანილი იქნა ადრე.';ru='Информация о сотруднике %1 была введена в документе ранее.';en='Information about the employee% 1 has been entered in the document earlier.'"), ВыборкаПоСтрокамДокумента.СотрудникНаименование);
				
				ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
					Ошибки, 
					Ссылка, 
					ВыборкаПоСтрокамДокумента.НомерСтрокиСотрудник,
					ТекстОшибки,
					"Сотрудник",
					Отказ);
																							
			ИначеЕсли ВыборкаПоСтрокамДокумента.КонфликтующаяСтрокаСтраховойНомер <> Null Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='თანამშრომელი %1: ინფორმაცია ამავე სადაზღვევო ნომრის მქონე თანამშრომლის შესახებ დოკუმენტში უწინ იქნა შეყვანილი.';ru='Сотрудник %1: информация о сотруднике с таким же страховым номером была введена в документе ранее.';en='Employee% 1: Information about the employee with the same insurance number was introduced earlier in the document.'"), ВыборкаПоСтрокамДокумента.СотрудникНаименование);
				
				ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
					Ошибки, 
					Ссылка, 
					ВыборкаПоСтрокамДокумента.НомерСтрокиСотрудник,
					ТекстОшибки,
					"СтраховойНомерПФР",
					Отказ);
			КонецЕсли;	
			
			
			ТарифыПоКатегориям = Новый Массив;
			
			ПроверитьСтрокиЗаработка(Ошибки, ВыборкаПоСтрокамДокумента, ВыборкаПоЗаработку, ТарифыПоКатегориям, Отказ);
			ПроверитьСтрокиВредногоЗаработка(Ошибки, ВыборкаПоСтрокамДокумента, ВыборкаПоВредномуЗаработку, Отказ);
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
		ПроверяемыйПериод = ОтчетныйПериод;
	Иначе
		ПроверяемыйПериод = КорректируемыйПериод;
	КонецЕсли;
			
КонецПроцедуры

Процедура ПроверитьДанныеШапкиДокумента(Ошибки, Отказ = Ложь, НеПроверяемыеРеквизиты = Неопределено)
	Если Сотрудники.Количество() > 200 Тогда
		ТекстОшибки = НСтр("ka='დოკუმენტში 200 ფორმაზე მეტი არ უნდა იყოს.';ru='В документе должно быть не более 200 форм.';en='The paper should be no more than 200 forms.'");
		
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияЭлементаДокумента(Ошибки, Ссылка, ТекстОшибки, , Отказ);
	КонецЕсли;
	
	Если ОтчетныйПериод < '20140101' Тогда
		ТекстОшибки = НСтр("ka='РСВ-1-ის ანგარიშსწორების 6 ნაწილების წარდგენა ხდება 2014 წლის 1 კვარტლიდან დაწყებული! 2010-2012 წლების ინფორმაციის შესადგენად გამოიყენეთ დოკუმენტი ""დოკუმენტების დასტა СЗВ-6-1"", ""რეესტრი СЗВ-6-2"" , 2013 წლისთვის გამოიყენეთ დოკუმენტი """"დოკუმენტების დასტა СЗВ-6-4"""".';ru='Разделы 6 Расчета РСВ-1 представляются начиная с 1 квартала 2014 года! Для формирования сведений за 2010-2012 годы используйте документ ""Пачка документов СЗВ-6-1"", ""Реестр СЗВ-6-2"" , за 2013 год используйте документ """"Пачка документов СЗВ-6-4"""".';en='Sections 6 Calculation of RSV-1 is starting with the 1st quarter of 2014! For the formation of data for the years 2010-2012 using the document ""A stack of documents BCR-6-1"", ""Register of BCR-6-2"", in 2013, use the document """" stack of documents BCR-6-4 "".""'");
		
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияЭлементаДокумента(Ошибки, Ссылка, ТекстОшибки, , Отказ);
	КонецЕсли;
	
	Если ТипСведенийСЗВ <> Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
		Если Не ЗначениеЗаполнено(КорректируемыйПериод) Тогда
			ТекстОшибки = НСтр("ka='კორექტირებადი საანგარიშგებო პერიოდი არ არის მითითებული.';ru='Не указан корректируемый отчетный период.';en='Unknown corrected the reporting period.'");
		
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияЭлементаДокумента(Ошибки, Ссылка, ТекстОшибки, "КорректируемыйПериод", Отказ);
		ИначеЕсли ОтчетныйПериод <= КорректируемыйПериод Тогда
			ТекстОшибки = НСтр("ka='კორექტირებადი პერიოდი უნდა უსწრებდეს საანგარიშგებო პერიოდს.';ru='Корректируемый период должен предшествовать отчетному.';en='Adjustable period must precede statements.'");
		
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияЭлементаДокумента(Ошибки, Ссылка, ТекстОшибки, "КорректируемыйПериод", Отказ);
		ИначеЕсли КорректируемыйПериод < '20140101' Тогда
			ТекстОшибки = НСтр("ka='ანგარიშსწორება РСВ-1-ის კორექტირებადი (გამაუქმებელი) ნაწილების 6 წარდგენა ხდება მხოლოდ 2014 წლის 1 კვარტლიდან მოყოლებული საანგარიშგებო პერიოდებისთვის.';ru='Корректирующие (отменяющие) Разделы 6 Расчета РСВ-1 представляются только за отчетные периоды c 1 квартала 2014 года.';en='Correcting (canceling) Sections 6 RSV-1 are to be submitted only for the reporting periods c Q1 2014.'");
		
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияЭлементаДокумента(Ошибки, Ссылка, ТекстОшибки, "КорректируемыйПериод", Отказ);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры	

Процедура ПроверитьСтрокиЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходам, ТарифыПоКатегориям, Отказ = Ложь)
	ПериодДанных = ?(ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ, ОтчетныйПериод, КорректируемыйПериод);
	
	МесяцС = Месяц(ПериодДанных);
	МесяцПо = МесяцС + 2;
	
	МесяцыДохода = Новый ТаблицаЗначений;
	МесяцыДохода.Колонки.Добавить("Месяц");
	МесяцыДохода.Колонки.Добавить("КатегорияЗастрахованныхЛиц");
	МесяцыДохода.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	
	РассчитанныйПФР = 0;
	ОблагаемыйЗаработокПоКатегории = 0;
	Заработок = 0;
	
	Если ВыборкаПоДоходам.СведенияЗаполнены Тогда
		Пока ВыборкаПоДоходам.СледующийПоЗначениюПоля("КатегорияЗастрахованныхЛиц") Цикл
			ОблагаемыйЗаработокПоКатегории = 0;
			Пока ВыборкаПоДоходам.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаПоДоходам.Месяц) 
					И (ВыборкаПоДоходам.Месяц < МесяцС Или ВыборкаПоДоходам.Месяц > МесяцПо)
					И ЗначениеЗаполнено(ПериодДанных) Тогда
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='ხელფასის სტრიქონებში მითითებულია თვე (%1), რომელიც საანგარიშგებო პერიოდს არ განეკუთვნება';ru='в строках заработка указан месяц (%1), не принадлежащий отчетному периоду';en='earnings in rows Set the month (% 1) does not belong to the reporting period'"), ВыборкаПоДоходам.Месяц);
					ПолныйТекстОшибки = ТекстОшибкиЗаработка(ВыборкаДанныхСотрудника.СотрудникНаименование, , ВыборкаПоДоходам.КатегорияЗастрахованныхЛиц, ТекстОшибки);
					
					ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуДанныхОЗаработкеЗаМесяц(
						Ошибки, 
						Ссылка, 
						ВыборкаПоДоходам.НомерСтрокиСотрудник,
						ВыборкаПоДоходам.НомерСтроки,
						ПолныйТекстОшибки,
						"Месяц",
						Отказ);	
				Иначе 	
					СтрокаТаблицы = МесяцыДохода.Добавить();
					СтрокаТаблицы.Месяц = ВыборкаПоДоходам.Месяц;
					СтрокаТаблицы.КатегорияЗастрахованныхЛиц = ВыборкаПоДоходам.КатегорияЗастрахованныхЛиц;
					СтрокаТаблицы.КоличествоСтрок = 1;
					
					Если ВыборкаПоДоходам.Месяц <> 0 Тогда
						ОблагаемыйЗаработокПоКатегории = ОблагаемыйЗаработокПоКатегории + ВыборкаПоДоходам.ОблагаетсяВзносамиДоПредельнойВеличины;
						Заработок = Заработок + ВыборкаПоДоходам.Заработок;
					КонецЕсли;	

				КонецЕсли;	
				
				Если Не ЗначениеЗаполнено(ВыборкаПоДоходам.КатегорияЗастрахованныхЛиц) Тогда
					ТекстОшибки = НСтр("ka='დაზღვეული პირების კატეგორია არ არის მითითებული';ru='не указана категория застрахованных лиц.';en='no indication of the category of insured persons.'");
					
					ДобавитьОшибкуЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходам, ТекстОшибки, Отказ);
				КонецЕсли;
				Если ВыборкаПоДоходам.Заработок = 0 И ВыборкаПоДоходам.ОблагаетсяВзносамиДоПредельнойВеличины = 0 И ВыборкаПоДоходам.ОблагаетсяВзносамиСвышеПредельнойВеличины = 0  Тогда
					ТекстОшибки = НСтр("ka='მითითებულია ნულოვანი მონაცემები.';ru='указаны нулевые данные.';en='given the null data.'");
					
					ДобавитьОшибкуЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходам, ТекстОшибки, Отказ);
				КонецЕсли;
				Если ВыборкаПоДоходам.Заработок < 0 Тогда
					ТекстОшибки = НСтр("ka='მითითებულია უარყოფითი ხელფასი.';ru='указан отрицательный заработок.';en='Set a negative earnings.'");
					
					ДобавитьОшибкуЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходам, ТекстОшибки, Отказ);
				КонецЕсли;
				Если ВыборкаПоДоходам.ОблагаетсяВзносамиДоПредельнойВеличины < 0 Тогда
					ТекстОшибки = НСтр("ka='მითითებულია უარყოფითი ბაზა, რომელიც უკიდურეს სიდიდეს არ აღემატება.';ru='указана отрицательная база, не превышающая предельную величину.';en='contains negative base not exceeding the limit value.'");
					
					ДобавитьОшибкуЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходам, ТекстОшибки, Отказ);
				КонецЕсли;
				Если ВыборкаПоДоходам.ПоДоговорамГПХДоПредельнойВеличины < 0 Тогда
					ТекстОшибки = НСтр("ka='სამოქალაქო-სამართლებრივი ხასიათის ხელშეკრულებების მიხედვით მითითებულია უარყოფითი ბაზა, რომელიც უკიდურეს სიდიდეს არ აღემატება';ru='указана отрицательная база по договорам ГПХ, не превышающая предельную величину';en='contains negative base on GPC contracts not exceeding the limit value'");
					
					ДобавитьОшибкуЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходам, ТекстОшибки, Отказ);
				КонецЕсли;
				Если ВыборкаПоДоходам.ОблагаетсяВзносамиСвышеПредельнойВеличины < 0 Тогда
					ТекстОшибки = НСтр("ka='მითითებულია უარყოფითი ბაზა, რომელიც უკიდურეს სიდიდეს აღემატება.';ru='указана отрицательная база, превышающая предельную величину.';en='contains negative base excess of the limit value.'");
					
					ДобавитьОшибкуЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходам, ТекстОшибки, Отказ);
				КонецЕсли;
				Если ВыборкаПоДоходам.Заработок < ВыборкаПоДоходам.ОблагаетсяВзносамиДоПредельнойВеличины + ВыборкаПоДоходам.ОблагаетсяВзносамиСвышеПредельнойВеличины Тогда
					ТекстОшибки = НСтр("ka='თანხა, რომელიც შენატანებით იბეგრება, დარიცხული ხელფასის ოდენობას აღემატება.';ru='сумма, облагаемая взносами, превышает сумму начисленного заработка.';en='amount taxable contributions exceeds the amount of accrued earnings.'");
					
					ДобавитьОшибкуЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходам, ТекстОшибки, Отказ);
				КонецЕсли;
				
			КонецЦикла;
			Тариф = ТарифыПоКатегориям.Получить(ВыборкаПоДоходам.КатегорияЗастрахованныхЛиц);
			
			Если Тариф <> Неопределено Тогда
				РассчитанныйПФР = РассчитанныйПФР + Окр(ОблагаемыйЗаработокПоКатегории * (Тариф.ПФРСтраховая + Тариф.ПФРНакопительная) / 100, 2);
			КонецЕсли;	
			
		КонецЦикла;	
		
		МесяцыДохода.Свернуть("КатегорияЗастрахованныхЛиц, Месяц", "КоличествоСтрок");
		
		Если ЗначениеЗаполнено(ПериодДанных) Тогда
			Для каждого СтрокаТаблицы Из МесяцыДохода Цикл
				Если СтрокаТаблицы.КоличествоСтрок > 1 Тогда
					ШаблонТекстаОшибки = НСтр("ka='თანამშრომელი %1: ნაწილ 6.4-ში (სახელფასო ინფორმაცია) კატეგორია %2-ით თვე #%3 მითითებულია ერთჯერ მეტად';ru='Сотрудник %1: в разделе 6.4 (сведения о заработке) по категории %2 месяц №%3 указан более одного раза';en='Employee% 1: Section 6.4 (data on earnings) category% 2% 3 month number is specified more than once'");
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										ШаблонТекстаОшибки,
										ВыборкаДанныхСотрудника.СотрудникНаименование,
										ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаТаблицы.КатегорияЗастрахованныхЛиц),
										СтрокаТаблицы.Месяц);
					
					ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
						Ошибки,
						Ссылка,
						ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
						ТекстОшибки, ,
						Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
		
	// П. 7.5.4. По всем разделам 6 значение, указанное в подразделе 6.5 должно быть равно сумме значений, 
	// указанных в графе 5 строк 401,402 и 403  (411, 412, 413 и т.д. (зависит от количества тарифов 
	// страховых взносов), умноженных на соответствующий текущему периоду тариф страховых взносов.
		
	ТекстОшибки = НСтр("ka='- значение, указанное в подразделе 6.5 (начислено на ОПС) должно быть равно сумме значений, указанных в графе 5 строк 401,402 и 403  (411, 412, 413 и т.д., зависит от количества тарифов страховых взносов),  умноженных на соответствующий текущему периоду тариф страховых взносов.';ru='- значение, указанное в подразделе 6.5 (начислено на ОПС) должно быть равно сумме значений, указанных в графе 5 строк 401,402 и 403  (411, 412, 413 и т.д., зависит от количества тарифов страховых взносов),  умноженных на соответствующий текущему периоду тариф страховых взносов.';en='- the meaning specified in section 6.5 (credited to the OPS) must be equal to the sum of the values ​​shown in column 5 lines 401.402 and 403 (411, 412, 413, etc., depending on the number of contribution rates), multiplied by the corresponding current period of the rate of insurance contributions.'");
	Разность = Макс(РассчитанныйПФР - ВыборкаДанныхСотрудника.НачисленоСтраховая, ВыборкаДанныхСотрудника.НачисленоСтраховая - РассчитанныйПФР);
	Если Разность > 0.03 Тогда
		ШаблонТекстаОшибки = НСтр("ka='თანამშრომელი %1: %2';ru='Сотрудник %1: %2';en='Employee% 1% 2'");	
		ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								ШаблонТекстаОшибки,
								ВыборкаДанныхСотрудника.СотрудникНаименование,
								ТекстОшибки);
							
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуДанныхОВзносах(
			Ошибки,
			Ссылка,
			ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
			ПолныйТекстОшибки, 
			"НачисленоСтраховая",
			Отказ);				
	КонецЕсли;		
		
	// П. 7.4.16. Если в подразделе 6.8 содержится запись в графах 2 и 3, которая не сопровождается записью с кодом «АДМИНИСТР», «ДЕТИ», «УЧОТПУСК», «ДЛДЕТИ», «ДЛОТПУСК», «ВРНЕТРУД», 
	// «ДЕКРЕТ», «ЧАЭС», «НЕОПЛ», «НЕОПЛДОГ» и «НЕОПЛАВТ»  обязательно наличие значения в графе 4 строки 401-403  подраздела 6.4
	Если Заработок = 0 И ВыборкаДанныхСотрудника.КоличествоОплачиваемыхСтрок > 0 Тогда
		ШаблонТекстаОшибки = НСтр("ka='თანამშრომელი %1: %2';ru='Сотрудник %1: %2';en='Employee% 1% 2'");
		
		ТекстОшибки = НСтр("ka='თუ ქვეთავ 6.8-ში არის ჩანაწერი გრაფა 2-ში და 3-ში, რომელსაც არ ახლავს ჩანაწერი კოდით ""ადმინისტრ"", ""ბავშვები"", ""სასწავლშვებულ"", ""ხანგრძშვილები"", ""ხანგრძლშვებულ"", ""დროებშრომისუუნარ"", ""დეკრეტი"", ""ჩერნობაეს"", ""არაანაზღაურებ"", ""არანაზღაურებხელშეკ"" და ""არანაზღაურებავტ"", მაშინ ქვეთავ 6.4-ის სტრიქონ 401-403-ის გრაფა 4-ში სავალდებულოა მნიშვნელობის არსებობა';ru='Если в подразделе 6.8 содержится запись в графах 2 и 3, которая не сопровождается записью с кодом «АДМИНИСТР», «ДЕТИ», «УЧОТПУСК», «ДЛДЕТИ», «ДЛОТПУСК», «ВРНЕТРУД», «ДЕКРЕТ», «ЧАЭС», «НЕОПЛ», «НЕОПЛДОГ» и «НЕОПЛАВТ»  обязательно наличие значения в графе 4 строки 401-403  подраздела 6.4';en='If subsection 6.8 contains a record in columns 2 and 3, which is not accompanied with the code entry ""Admin"", ""children"", ""UCHOTPUSK"", ""DLDETI"", ""DLOTPUSK"", ""VRNETRUD"", the ""Decree"", ""Chernobyl"" ""NEOPL"", ""NEOPLDOG"" and ""NEOPLAVT"" necessarily availability values ​​in column 4 lines 401-403 subsection 6.4'");
		
		ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								ШаблонТекстаОшибки,
								ВыборкаДанныхСотрудника.СотрудникНаименование,
								ТекстОшибки);

		
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
			Ошибки,
			Ссылка,
			ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
			ПолныйТекстОшибки, ,
			Отказ);				
	КонецЕсли;
	
		
КонецПроцедуры	

Процедура ДобавитьОшибкуЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоЗаработку, ТекстОшибки, Отказ = Ложь)
	ПолныйТекстОшибки = ТекстОшибкиЗаработка(
							ВыборкаДанныхСотрудника.СотрудникНаименование,
							ВыборкаПоЗаработку.Месяц, 
							ВыборкаПоЗаработку.КатегорияЗастрахованныхЛиц, 
							ТекстОшибки);	
							
							
	ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуДанныхОЗаработкеЗаМесяц(
		Ошибки,
		Ссылка,
		ВыборкаПоЗаработку.НомерСтрокиСотрудник,
		ВыборкаПоЗаработку.НомерСтроки,
		ПолныйТекстОшибки,
		Отказ);
КонецПроцедуры	

Функция ТекстОшибкиЗаработка(НаименованиеСотрудника, Месяц = Неопределено, КатегорияЗастрахованныхЛиц = Неопределено, ТекcтОшибки)
	Если Месяц = Неопределено Тогда
		ОписаниеМесяца = "";	
	Иначе	
		ОписаниеМесяца = ?(Месяц = 0, НСтр("ka='- в показателе С начала года ';ru='- в показателе С начала года '"), НСтр("ka='- за ';ru='- за '") + Месяц + НСтр("ka='-й месяц ';ru='-й месяц '"));	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(КатегорияЗастрахованныхЛиц) Тогда
		ОписаниеКатегории = "";
	Иначе
		ОписаниеКатегории = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ka='по категории %1 ';ru='по категории %1 '"),
								ОбщегоНазначения.ИмяЗначенияПеречисления(КатегорияЗастрахованныхЛиц));
		
	КонецЕсли;	
	
	ШаблонТекстаОшибки = НСтр("ka='თანამშრომელი %1: ნაწილ 6.4-ში (ინფორმაცია ხელფასის შესახებ) %2%3%4';ru='Сотрудник %1: в разделе 6.4 (сведения о заработке) %2%3%4';en='Employee% 1: Section 6.4 (data on earnings)% 2% 3% 4'");
	
	ПолныйТекстОшибки  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							ШаблонТекстаОшибки,
							НаименованиеСотрудника, 
							ОписаниеМесяца, 
							ОписаниеКатегории, 
							ТекcтОшибки);
	
	Возврат ПолныйТекстОшибки;
КонецФункции	

Процедура ПроверитьСтрокиВредногоЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах, Отказ = Ложь)
	ПериодДанных = ?(ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ, ОтчетныйПериод, КорректируемыйПериод);
	
	МесяцС = Месяц(ПериодДанных);
	МесяцПо = МесяцС + 2;
	
	МесяцыДохода = Новый ТаблицаЗначений;
	МесяцыДохода.Колонки.Добавить("Месяц");
	МесяцыДохода.Колонки.Добавить("КлассУсловийТруда");
	МесяцыДохода.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	
	ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВПервомМесяце = 0;
	ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВПервомМесяце = 0;
	ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВоВторомМесяце = 0;
	ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВоВторомМесяце = 0;
	ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВТретьемМесяце = 0;
	ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВТретьемМесяце = 0;

	Если ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.СведенияЗаполнены Тогда
		Пока ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.СледующийПоЗначениюПоля("КлассУсловийТруда") Цикл
			Пока ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Следующий() Цикл 		
				Если ЗначениеЗаполнено(ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Месяц) 
					И (ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Месяц < МесяцС Или ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Месяц > МесяцПо)
					И ЗначениеЗаполнено(ПериодДанных) Тогда
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ka='ხელფასის სტრიქონებში მითითებულია თვე (%1), რომელიც საანგარიშგებო პერიოდს არ განეკუთვნება';ru='в строках заработка указан месяц (%1), не принадлежащий отчетному периоду';en='earnings in rows Set the month (% 1) does not belong to the reporting period'"), 
									ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Месяц);
									
					ПолныйТекстОшибки = ТекстОшибкиВредногоЗаработка(
											ВыборкаДанныхСотрудника.СотрудникНаименование, , 
											ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.КлассУсловийТруда, 
											ТекстОшибки);
					
				Иначе
					СтрокаТаблицы = МесяцыДохода.Добавить();
					СтрокаТаблицы.Месяц = ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Месяц;
					СтрокаТаблицы.КлассУсловийТруда = ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.КлассУсловийТруда;
					СтрокаТаблицы.КоличествоСтрок = 1;
				КонецЕсли;	

				Если ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Месяц = МесяцС Тогда
					ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВПервомМесяце = ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах;
					ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВПервомМесяце = ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах;
				КонецЕсли;
				Если ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Месяц = МесяцС + 1 Тогда
					ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВоВторомМесяце = ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах;
					ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВоВторомМесяце = ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах;
				КонецЕсли;
				Если ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.Месяц = МесяцС + 2 Тогда
					ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВТретьемМесяце = ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах;
					ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВТретьемМесяце = ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах;
				КонецЕсли;

				Если ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах < 0 Тогда
					ТекстОшибки = НСтр("ka='მითითებულია მიწისქვეშა და მავნე სამუშაოებზე დაკავებულების შენატანების უარყოფითი ბაზა.';ru='указана отрицательная база взносов за занятых на подземных и вредных работах.';en='contains negative base fees engaged in underground and hazardous work.'");
					
					ДобавитьОшибкуВредногоЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах, ТекстОшибки, Отказ = Ложь);
				КонецЕсли;
				Если ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах < 0 Тогда
					ТекстОшибки = НСтр("ka='მძიმე სამუშაოებზე დაკავებულებზე მითითებულია შენატანების უარყოფითი ბაზა.';ru='указана отрицательная база взносов за занятых на тяжелых работах.';en='contains negative base fees engaged in heavy work.'");
					
					ДобавитьОшибкуВредногоЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоДоходамЗанятыхНаВредныхИТяжелыхРаботах, ТекстОшибки, Отказ = Ложь)
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
		
		МесяцыДохода.Свернуть("КлассУсловийТруда, Месяц", "КоличествоСтрок");
		
		Если ЗначениеЗаполнено(ПериодДанных) Тогда 
			Для каждого СтрокаТаблицы Из МесяцыДохода Цикл
				Если СтрокаТаблицы.КоличествоСтрок > 1 Тогда
					ШаблонТекстаОшибки = НСтр("ka='ქვეთავ 6.7-ში თანამშრომელი %1 (ინფორმაცია ვადამდელი პენსიის უფლების მქონე სამუშაოებზე დაკავებულებისთვის გადახდების შესახებ) შრომის პირობების კლასით %2 თვე #%3 ერთჯერ მეტად არის მითითებული';ru='Сотрудник %1: в разделе 6.7 (Сведения о выплатах занятых на работах дающих право на досрочную пенсию) по классу условий труда %2 месяц №%3 указан более одного раза';en='Employee% 1: Section 6.7 (Information about the payments involved in work giving the right to early retirement) in the class working environment% 2% 3 month number is specified more than once'");
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										ШаблонТекстаОшибки,
										ВыборкаДанныхСотрудника.СотрудникНаименование,
										СтрокаТаблицы.КлассУсловийТруда,
										СтрокаТаблицы.Месяц);
					
					ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
						Ошибки,
						Ссылка,
						ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
						ТекстОшибки, ,
						Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
	//П 7.8.2 По всем разделам 6 при наличии ненулевых значений в строках 701,702,703,711,712,713  графы 4 подраздела 6.7  
	//обязательно наличие в графе «Особые условия труда (код)» кода особых условий труда 27-1 для соответствующих периодов, 
	//указанных в графах 2 и 3 подраздела 6.8
	
	//П 7.8.4 По всем разделам 6 при наличии в графе «Особые условия труда (код)» подраздела 6.8  кода особых условий 
	//труда 27-1 и отсутствии кода «ДЕКРЕТ», «ВРНЕТРУД», «ВАХТА», «ДЛОТПУСК», то для соответствующих месяцев обязательно 
	//наличие ненулевых значений в графе 4 подраздела 6.7  за соответствующие месяцы (строки 701, 702, 703, 711, 712, 713). 
	
	ШаблонТекстаОшибки = НСтр("ka='თანამშრომელი %1: %2';ru='Сотрудник %1: %2';en='Employee% 1% 2'");
	Если ВыборкаДанныхСотрудника.Ст27_1ВПервомМесяце Тогда
		Если ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВПервомМесяце = 0 Тогда
			ТекстОшибки = НСтр("ka='საანგარიშო პერიოდის პირველი თვის შრომის განსაკუთრებული პირობების მე-6.7 ქვეგანყოფილების სტრიქონებში 27-1 კოდის არსებობის შემთხვევაში  აუცილებელია მნიშვნელობათა არსებობა მე-4 გრაფის მე-6.7 ქვეგანყოფილების სტრიქონებში 701,711...';ru='При наличии кода 27-1 особых условий труда в строках подраздела 6.8 за первый месяц отчетного периода обязательно наличие значений в графе 4 подраздела 6.7 в строках 701,711 ...';en='In the presence of the code 27-1 specific working conditions in the rows of subsection 6.8 for the first month of the reporting period, one must have the values ​​in column 4 of subsection 6.7 in rows 701.711 ...'");
			
			ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
				Ошибки,
				Ссылка,
				ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
				ПолныйТекстОшибки,
				Отказ);
		КонецЕсли; 
	ИначеЕсли ВыборкаДанныхСотрудника.НеПроверятьСт27_1ВПервомМесяце Тогда // коды есть, но проверять не надо	
	ИначеЕсли ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВПервомМесяце <> 0 Тогда	
		ТекстОшибки = НСтр("ka='ქვეთავ 6.7-ის გრაფა 4-ის სტრიქონ 701, 711...-ში არანულოვანი მნიშვნელობების არსებობის შემთხვევაში, გრაფა ""შრომის განსაკუთრებული პირობები (კოდი)""-ში ქვეთავ 6.8-ის სტრიქონებში შრომის განსაკუთრებული პირობების კოდ 27-1-ის არსებობა სავალდებულოა საანგარიშგებო პერიოდის პირველი თვისთვის';ru='При наличии ненулевых значений в строках 701,711 ... графы 4 подраздела 6.7  обязательно наличие в графе «Особые условия труда (код)» кода особых условий труда 27-1 в строках подраздела 6.8 за первый месяц отчетного периода';en='In the presence of non-zero values ​​in the row ... 701.711 graphs 4 subsection 6.7 one must have in the column ""Specific conditions of work (code)"" Code of special working conditions in the rows 27-1 subsection 6.8 for the first month of the reporting period'");
		
		ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
			Ошибки,
			Ссылка,
			ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
			ПолныйТекстОшибки,
			Отказ);
	КонецЕсли;
	Если ВыборкаДанныхСотрудника.Ст27_1ВоВторомМесяце Тогда
		Если ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВоВторомМесяце = 0 Тогда
			ТекстОшибки = НСтр("ka=' საანგარიშო პერიოდის მეორე თვის შრომის განსაკუთრებული პირობების მე-6.8 ქვეგანყოფილების სტრიქონებში  27-1 კოდის არსებობის შემთხვევაში  აუცილებელია მნიშვნელობათა არსებობა მე-4 გრაფის მე-6.7 ქვეგანყოფილების სტრიქონებში 702,712...';ru='При наличии кода 27-1 особых условий труда в строках подраздела 6.8 за второй месяц отчетного периода обязательно наличие значений в графе 4 подраздела 6.7 в строках 702,712 ...';en='In the presence of the code 27-1 specific working conditions in the rows of subsection 6.8 for the second month of the reporting period, one must have the values ​​in column 4 of subsection 6.7 in rows 702.712 ...'");
			
			ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
				Ошибки,
				Ссылка,
				ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
				ПолныйТекстОшибки,
				Отказ);

		КонецЕсли;
	ИначеЕсли ВыборкаДанныхСотрудника.НеПроверятьСт27_1ВоВторомМесяце Тогда // коды есть, но проверять не надо
	ИначеЕсли ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВоВторомМесяце <> 0 Тогда	
		ТекстОшибки = НСтр("ka='ქვეთავ 6.7-ის გრაფა 4-ის სტრიქონ 702, 712...-ში არანულოვანი მნიშვნელობების არსებობის შემთხვევაში, გრაფა ""შრომის განსაკუთრებული პირობები (კოდი)""-ში ქვეთავ 6.8-ის სტრიქონებში საანგარიშგებო პერიოდის მეორე თვისთვის სავალდებულოა შრომის განსაკუთრებული პირობების 27-1-ის კოდის არსებობა';ru='При наличии ненулевых значений в строках 702,712 ... графы 4 подраздела 6.7  обязательно наличие в графе «Особые условия труда (код)» кода особых условий труда 27-1 в строках подраздела 6.8 за второй месяц отчетного периода';en='In the presence of non-zero values ​​in the row ... 702.712 graphs 4 subsection 6.7 one must have in the column ""Specific conditions of work (code)"" Code of special working conditions in the rows 27-1 subsection 6.8 for the second month of the reporting period'");
		
		ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
			Ошибки,
			Ссылка,
			ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
			ПолныйТекстОшибки,
			Отказ);
		
	КонецЕсли;
	Если ВыборкаДанныхСотрудника.Ст27_1ВТретьемМесяце Тогда
		Если ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВТретьемМесяце = 0 Тогда
			ТекстОшибки = НСтр("ka=' საანგარიშო პერიოდის მესამე თვის შრომის განსაკუთრებული პირობების მე-6.8 ქვეგანყოფილების სტრიქონებში  27-1 კოდის არსებობის შემთხვევაში  აუცილებელია მნიშვნელობათა არსებობა მე-4 გრაფის მე-6.7 ქვეგანყოფილების სტრიქონებში 703,713...';ru='При наличии кода 27-1 особых условий труда в строках подраздела 6.8 за третий месяц отчетного периода обязательно наличие значений в графе 4 подраздела 6.7 в строках 703,713 ...';en='In the presence of the code 27-1 specific working conditions in the rows of subsection 6.8 of the third month of the reporting period, one must have the values ​​in column 4 of subsection 6.7 in rows 703.713 ...'");

			ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
				Ошибки,
				Ссылка,
				ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
				ПолныйТекстОшибки,
				Отказ);

		КонецЕсли;
	ИначеЕсли ВыборкаДанныхСотрудника.НеПроверятьСт27_1ВТретьемМесяце Тогда // коды есть, но проверять не надо
	ИначеЕсли ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботахВТретьемМесяце <> 0 Тогда	
		ТекстОшибки = НСтр("ka='ქვეთავ 6.7-ის 703,713 ... სტრიქონებში არანულოვანი მნიშვნელობების არსებობის შემთხვევაში აუცილებელია საანგარიშგებო პერიოდის მესამე თვისთვის ქვეთავ 6.8-ის სტრიქონებში გრაფა ""შრომის განსაკუთრებული პირობები (კოდი)""-ში შრომის განსაკუთრებული პირობების კოდის 27-1-ის არსებობა';ru='При наличии ненулевых значений в строках 703,713 ... графы 4 подраздела 6.7  обязательно наличие в графе «Особые условия труда (код)» кода особых условий труда 27-1 в строках подраздела 6.8 за третий месяц отчетного периода';en='In the presence of non-zero values ​​in the row ... 703.713 graphs 4 subsection 6.7 one must have in the column ""Specific conditions of work (code)"" Code of special working conditions in the rows 27-1 subsection 6.8 for the third month of the reporting period'");
		
		ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
			Ошибки,
			Ссылка,
			ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
			ПолныйТекстОшибки,
			Отказ);

	КонецЕсли;
	
	//П 7.8.3 По всем разделам 6 при наличии ненулевых значений в строках 701,702,703,711,712,713  графы 5 подраздела 6.7  
	//обязательно наличие  для соответствующих периодов, указанных в графах 2 и 3 подраздела 6.8  в графе «Особые условия 
	//труда (код)» одного из кодов особых условий труда, (кроме «27-1» ,«28-СЕВ», «27-2» в сочетании со значением 23307000-17541 
	//элемента Код позиции списка) то есть указаны 27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ,  
	//или в графе «Условия для досрочного назначения трудовой пенсии. Основание (код)» подраздела 6.8  в строке периода работы 
	//за соответствующий месяц должно быть указано одно из значений: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, 
	//УЧЛЕТ, ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15..
	
	//П 7.8.5 По всем разделам 6 при наличии в графе «Особые условия труда (код)» подраздела 6.8 одного из кодов особых условий 
	//труда, кроме «27-1», «28-СЕВ», «27-2» в сочетании со значением 23307000-17541 элемента Код позиции списка  (то есть указаны 
	//27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ)  или в графе «Условия для досрочного назначения 
	//трудовой пенсии. Основание (код)» указано одно из значений: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, 
	//УЧЛЕТ, ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15 и отсутствии   кода «ДЕКРЕТ», «ВРНЕТРУД», «ВАХТА», 
	//«ДЛОТПУСК», то для соответствующих месяцев обязательно наличие ненулевых  значений в графе 5 подраздела 6.7  за 
	//соответствующие месяцы (строки 701, 702, 703, 711, 712, 713). 
		
	Если ВыборкаДанныхСотрудника.ОстальныеКодыВПервомМесяце Тогда
		Если ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВПервомМесяце = 0 Тогда
			ТекстОшибки = НСтр("ka='საანგარიშგებო პერიოდის მეორე თვისთვის ქვეთავ 6.8-ის სტრიქონებში გრაფა ""შრომის განსაკუთრებული პირობები (კოდი)""-ში შრომის განსაკუთრებული პირობების ერთ-ერთი კოდის არსებობის შემთხვევაში, გარდა ""27-1""და ""28-ჩრდ"" (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ) ან გრაფა ""შრომითი პენსიის ვადამდე დასანიშნი პირობები. საფუძველი (კოდი)""-ში ერთ-ერთი კოდისა: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, თვითმფრინავი, სპეცავია, სამაშვავია, სასწავფრენა, უმაღლპილოტ, НОРМАПР, НОРМСП, რეაქტ, საფრსამუშ, 27-14, 27-15 სავალდებულოა ქვეთავ 6.7-ის გრაფა 5-ში მნიშვნელობების არსებობა სტრიქონებში 701,711 ...';ru='При наличии в строках подраздела 6.8 за первый месяц отчетного периода в графе «Особые условия труда (код)» одного из кодов особых условий труда, кроме «27-1» и «28-СЕВ»  (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ)  или в графе «Условия для досрочного назначения трудовой пенсии. Основание (код)» одного из кодов: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, УЧЛЕТ, ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15 обязательно наличие значений в графе 5 подраздела 6.7 в строках 701,711 ...';en='If there is a row of subsection 6.8 for the first month of the reporting period in the column ""Specific conditions of work (code)"" one of the codes specific working conditions, except for ""27-1"" and ""28-SEV"" (27-2, 27-3, 27 -4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27 OS, 27-RV) or in the ""Terms and conditions for the early appointment of labor pension. The base (code) ""one of the codes: 27-11-GR-VP 27-11, 27-12, 27-SP, AIRCRAFT, SPETSAV, saves, UCHLET, VYSSHPIL, NORMAPR, NORMSP, reactivity LETRAB, 27-14 , 27-15 necessary to have sub-6.7 in the column values ​​in the rows 5 701.711 ...'");

			ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
				Ошибки,
				Ссылка,
				ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
				ПолныйТекстОшибки,
				Отказ);
				
		КонецЕсли;
	ИначеЕсли ВыборкаДанныхСотрудника.НеПроверятьОстальныеКодыВПервомМесяце Тогда // коды есть, но проверять не надо
	ИначеЕсли ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВПервомМесяце <> 0 Тогда
		ТекстОшибки = НСтр("ka=' მე-5 გრაფის მე-6.7 ქვეგანყოფილების სტრიქონებში 702, 712. არანულოვანი მნიშვნელობის არსებობის შემთხვევაში  აუცილებელია საანგარიშო პერიოდის პირველი თვის განმავლობაში  6.8 ქვეგანყოფილების სტრიქონებში გრაფაში ” მუშაობის განსაკუთრებული პირობები”(კოდი) შრომის პირობების ერთ-ერთი კოდის არსებობა  გარდა  «27-1» და «28-СЕВ» (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС,27-ПЖ) ან გრაფაში ვადამდელი პენსიის დანიშვნის პირობები. საფუძველი (კოდი)>> კოდებიდან ერთ-ერთის 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, УЧЛЕТ, ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15 "
"';ru='При наличии ненулевых значений в строках 701,711 ... графы 5 подраздела 6.7 обязательно наличие в строках подраздела 6.8 за первый месяц отчетного периода в графе «Особые условия труда (код)» одного из кодов особых условий труда, кроме «27-1» и «28-СЕВ» (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ) или в графе «Условия для досрочного назначения трудовой пенсии. Основание (код)» одного из кодов: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, УЧЛЕТ, ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15';en='In the presence of non-zero values ​​in the row ... 701.711 graphs 5 subsection 6.7 necessarily the presence of lines of subsection 6.8 for the first month of the reporting period in the column ""Specific conditions of work (code)"" one of the codes specified conditions of employment, except for ""27-1"" and "" 28-SEV ""(27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27 OS, 27-RV) or in the column ""Conditions for the early appointment of labor pension. The base (code) ""one of the codes: 27-11-GR-VP 27-11, 27-12, 27-SP, AIRCRAFT, SPETSAV, saves, UCHLET, VYSSHPIL, NORMAPR, NORMSP, reactivity LETRAB, 27-14 , 27-15'");
		
		ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
			Ошибки,
			Ссылка,
			ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
			ПолныйТекстОшибки,
			Отказ);

	КонецЕсли;
	Если ВыборкаДанныхСотрудника.ОстальныеКодыВоВторомМесяце Тогда
		Если ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВоВторомМесяце = 0 Тогда
			ТекстОшибки = НСтр("ka='საანგარიშგებო პერიოდის მეორე თვისთვის ქვეთავ 6.8-ის სტრიქონებში გრაფა ""შრომის განსაკუთრებული პირობები (კოდი)""-ში შრომის განსაკუთრებული პირობების ერთ-ერთი კოდის არსებობის შემთხვევაში, გარდა ""27-1""და ""28-ჩრდ"" (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ) ან გრაფა ""შრომითი პენსიის ვადამდე დასანიშნი პირობები. საფუძველი (კოდი)""-ში ერთ-ერთი კოდისა: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, თვითმფრინავი, სპეცავია, სამაშვავია, სასწავფრენა, უმაღლპილოტ, НОРМАПР, НОРМСП, რეაქტ, საფრსამუშ, 27-14, 27-15 სავალდებულოა ქვეთავ 6.7-ის გრაფა 5-ში მნიშვნელობების არსებობა სტრიქონებში 702,712 ...';ru='При наличии в строках подраздела 6.8 за второй месяц отчетного периода в графе «Особые условия труда (код)» одного из кодов особых условий труда, кроме «27-1» и «28-СЕВ» 27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ)  или в графе «Условия для досрочного назначения трудовой пенсии. Основание (код)» одного из кодов: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, УЧЛЕТ, ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15 обязательно наличие значений в графе 5 подраздела 6.7 в строках 702,712 ...';en='If there is a row of subsection 6.8 for the second month of the reporting period in the column ""Specific conditions of work (code)"" one of the codes specific working conditions, except for ""27-1"" and ""28-SEV"" 27-2, 27-3, 27- 4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27 OS, 27-RV) or in the ""Terms and conditions for the early appointment of labor pension. The base (code) ""one of the codes: 27-11-GR-VP 27-11, 27-12, 27-SP, AIRCRAFT, SPETSAV, saves, UCHLET, VYSSHPIL, NORMAPR, NORMSP, reactivity LETRAB, 27-14 , 27-15 necessary to have sub-6.7 in the column values ​​in the rows 5 702.712 ...'");
			
			ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
				Ошибки,
				Ссылка,
				ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
				ПолныйТекстОшибки,
				Отказ);

		КонецЕсли; 
	ИначеЕсли ВыборкаДанныхСотрудника.НеПроверятьОстальныеКодыВоВторомМесяце Тогда // коды есть, но проверять не надо
	ИначеЕсли ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВоВторомМесяце <> 0 Тогда	
		ТекстОшибки = НСтр("ka='ქვეთავ 6.7-ის გრაფა 5-ის სტრიქონ 702, 712...-ში არანულოვანი მნიშვნელობების არსებობის შემთხვევაში, ქვეთავ 6.8-ის სტრიქონებში საანგარიშგებო პერიოდის მეორე თვისთვის გრაფა ""შრომის განსაკუთრებული პირობები (კოდი)""-ში სავალდებულოა შრომის განსაკუთრებული პირობების ერთ-ერთი კოდის არსებობა, გარდა ""27-1"" და ""28-ჩრდ"" (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ) ან გრაფა ""შრომითი პენსიის ვადამდე დასანიშნი პირობები. საფუძველი (კოდი)""-ში ერთ-ერთი კოდის: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, თვითმფრინავი, სპეცავია, სამაშვავია, სასწფრენა, უმაღლპილოტ, НОРМАПР, НОРМСП, რეაქტ, საფრსამუშ, 27-14, 27-15';ru='При наличии ненулевых значений в строках 702,712 ... графы 5 подраздела 6.7 обязательно наличие в строках подраздела 6.8 за второй месяц отчетного периода в графе «Особые условия труда (код)» одного из кодов особых условий труда, кроме «27-1» и «28-СЕВ» (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ)  или в графе «Условия для досрочного назначения трудовой пенсии. Основание (код)» одного из кодов: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, УЧЛЕТ,  ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15';en='In the presence of non-zero values ​​in the row ... 702.712 graphs 5 subsection 6.7 necessarily the presence of lines of subsection 6.8 for the second month of the reporting period in the column ""Specific conditions of work (code)"" one of the codes specified conditions of employment, except for ""27-1"" and "" 28-SEV ""(27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27 OS, 27-RV) or in the column ""Conditions for the early appointment of labor pension. The base (code) ""one of the codes: 27-11-GR-VP 27-11, 27-12, 27-SP, AIRCRAFT, SPETSAV, saves, UCHLET, VYSSHPIL, NORMAPR, NORMSP, reactivity LETRAB, 27-14 , 27-15'");
		
		ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
			Ошибки,
			Ссылка,
			ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
			ПолныйТекстОшибки,
			Отказ);
			
	КонецЕсли;
	Если ВыборкаДанныхСотрудника.ОстальныеКодыВТретьемМесяце Тогда
		Если ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВТретьемМесяце = 0 Тогда
			ТекстОшибки = НСтр("ka='საანგარიშგებო პერიოდის მეორე თვისთვის ქვეთავ 6.8-ის სტრიქონებში გრაფა ""შრომის განსაკუთრებული პირობები (კოდი)""-ში შრომის განსაკუთრებული პირობების ერთ-ერთი კოდის არსებობის შემთხვევაში, გარდა ""27-1""და ""28-ჩრდ"" 27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ) ან გრაფა ""შრომითი პენსიის ვადამდე დასანიშნი პირობები. საფუძველი (კოდი)""-ში ერთ-ერთი კოდისა: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, თვითმფრინავი, სპეცავია, სამაშვავია, სასწავფრენა, უმაღლპილოტ, НОРМАПР, НОРМСП, რეაქტ, საფრსამუშ, 27-14, 27-15 სავალდებულოა ქვეთავ 6.7-ის გრაფა 5-ში მნიშვნელობების არსებობა სტრიქონებში 701,711 ...';ru='При наличии в строках подраздела 6.8 за третий месяц отчетного периода в графе «Особые условия труда (код)» одного из кодов особых условий труда, кроме «27-1» и «28-СЕВ» (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ)  или в графе «Условия для досрочного назначения трудовой пенсии. Основание (код)» одного из кодов: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, УЧЛЕТ, ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15 обязательно наличие значений в графе 5 подраздела 6.7 в строках 701,711 ...';en='If there is a row of subsection 6.8 of the third month of the reporting period in the column ""Specific conditions of work (code)"" one of the codes specific working conditions, except for ""27-1"" and ""28-SEV"" (27-2, 27-3, 27 -4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27 OS, 27-RV) or in the ""Terms and conditions for the early appointment of labor pension. The base (code) ""one of the codes: 27-11-GR-VP 27-11, 27-12, 27-SP, AIRCRAFT, SPETSAV, saves, UCHLET, VYSSHPIL, NORMAPR, NORMSP, reactivity LETRAB, 27-14 , 27-15 necessary to have sub-6.7 in the column values ​​in the rows 5 701.711 ...'");
			
			ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
			ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
				Ошибки,
				Ссылка,
				ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
				ПолныйТекстОшибки,
				Отказ);
			
		КонецЕсли; 
	ИначеЕсли ВыборкаДанныхСотрудника.НеПроверятьОстальныеКодыВТретьемМесяце Тогда // коды есть, но проверять не надо	
	ИначеЕсли ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботахВТретьемМесяце <> 0 Тогда	
		ТекстОшибки = НСтр("ka='ქვეთავ 6.7-ის გრაფა 5-ის 701,711 ... სტრიქონებში არანულოვანი მნიშვნელობების არსებობის შემთხვევაში სავალდებულოა ქვეთავ 6.8-ის საანგარიშგებო პერიოდის მესამე თვისთვის გრაფა ""შრომის განსაკუთრებული პირობები (კოდი)""-ში შრომის განსაკუთრებული პირობების ერთ-ერთი კოდის არსებობა, გარდა ""27-1""-ისა და ""28-ჩრდ""-ისა (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ) ან გრაფა ""შრომითი პენსიის ვადამდელი დანიშვნის პირობები. საფუძველი (კოდი)""-ში ერთ-ერთი შემდეგი კოდის: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, თვითმფრინავი, სპეცავ, სამაშვავ, სასწფრენ,  უმაღლპილოტ, НОРМАПР, НОРМСП, რეაქტი, ЛЕТРАБ, 27-14, 27-15';ru='При наличии ненулевых значений в строках 701,711 ... графы 5 подраздела 6.7 обязательно наличие в строках подраздела 6.8 за третий месяц отчетного периода в графе «Особые условия труда (код)» одного из кодов особых условий труда, кроме «27-1» и «28-СЕВ» (27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27-ОС, 27-ПЖ) или в графе «Условия для досрочного назначения трудовой пенсии. Основание (код)» одного из кодов: 27-11-ГР, 27-11-ВП, 27-12, 27-СП, САМОЛЕТ, СПЕЦАВ, СПАСАВ, УЧЛЕТ,  ВЫСШПИЛ, НОРМАПР, НОРМСП, РЕАКТИВН, ЛЕТРАБ, 27-14, 27-15';en='In the presence of non-zero values ​​in the row ... 701.711 graphs 5 subsection 6.7 necessarily the presence of lines of subsection 6.8 of the third month of the reporting period in the column ""Specific conditions of work (code)"" one of the codes specified conditions of employment, except for ""27-1"" and "" 28-SEV ""(27-2, 27-3, 27-4, 27-5, 27-6, 27-7, 27-8, 27-9, 27-10, 27 OS, 27-RV) or in the column ""Conditions for the early appointment of labor pension. The base (code) ""one of the codes: 27-11-GR-VP 27-11, 27-12, 27-SP, AIRCRAFT, SPETSAV, saves, UCHLET, VYSSHPIL, NORMAPR, NORMSP, reactivity LETRAB, 27-14 , 27-15'");
		
		ПолныйТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонТекстаОшибки,
									ВыборкаДанныхСотрудника.СотрудникНаименование,
									ТекстОшибки);
									
		ПерсонифицированныйУчетКлиентСервер.ДобавитьОшибкуЗаполненияСпискаСотрудников(
			Ошибки,
			Ссылка,
			ВыборкаДанныхСотрудника.НомерСтрокиСотрудник,
			ПолныйТекстОшибки,
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ДобавитьОшибкуВредногоЗаработка(Ошибки, ВыборкаДанныхСотрудника, ВыборкаПоЗаработку, ТекстОшибки, Отказ = Ложь)
	ПолныйТекстОшибки = ТекстОшибкиВредногоЗаработка(
							ВыборкаДанныхСотрудника.СотрудникНаименование,
							ВыборкаПоЗаработку.Месяц, 
							ВыборкаПоЗаработку.КлассУсловийТруда, 
							ТекстОшибки);	
							
							
КонецПроцедуры

Функция ТекстОшибкиВредногоЗаработка(НаименованиеСотрудника, Месяц = Неопределено, КлассУсловийТруда = Неопределено, ТекcтОшибки)
	Если Месяц = Неопределено Тогда
		ОписаниеМесяца = "";	
	Иначе	
		ОписаниеМесяца = ?(Месяц = 0, НСтр("ka='- в показателе С начала года ';ru='- в показателе С начала года '"), НСтр("ka='- за ';ru='- за '") + Месяц + "ru = '-й месяц '");	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(КлассУсловийТруда) Тогда
		ОписаниеКлассаУсловийТруда = "";
	Иначе
		ОписаниеКлассаУсловийТруда = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ka='по классу условий труда %1 ';ru='по классу условий труда %1 '"),
										КлассУсловийТруда);
		
	КонецЕсли;	
	
	ШаблонТекстаОшибки = НСтр("ka='თანამშრომელი %1: ნაწილ 6.7-ში (ინფორმაცია ვადამდელი პენსიის უფლების მქონე სამუშაოებზე დაკავებულებისთვის გადახდების შესახებ) %2%3%4';ru='Сотрудник %1: в разделе 6.7 (Сведения о выплатах занятых на работах дающих право на досрочную пенсию) %2%3%4';en='Employee% 1: Section 6.7 (Information about the payments involved in work giving the right to early retirement)% 2% 3% 4'");
	
	ПолныйТекстОшибки  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							ШаблонТекстаОшибки, 
							НаименованиеСотрудника, 
							ОписаниеМесяца, 
							ОписаниеКлассаУсловийТруда, 
							ТекcтОшибки);
	
	Возврат ПолныйТекстОшибки;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Подсистема "Управление доступом"

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	
КонецПроцедуры

// Подсистема "Управление доступом"


Функция ОкончаниеОтчетногоПериода() Экспорт
	
	Возврат ПерсонифицированныйУчетКлиентСервер.ОкончаниеОтчетногоПериодаПерсУчета(ОтчетныйПериод);
	
КонецФункции

#КонецЕсли
